БухЭксп/Reports/CW_КонтрагентыИспользующиеМодульБухгалтерияЭкпедитора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_КонтрагентыИспользующиеМодульБухгалтерияЭкпедитора</Name>
		</Properties>
	</Report>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_СтатусыЭОДПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СтатусыЭОДПокупателей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГотовПриниматьДокументы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МожетПриниматьДокументы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_СтатусыЭОДПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СтатусыЭОДПоставщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПредоставляетДокументы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовПредоставлятьДокументы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МожетПредоставлятьДокументы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Reports/CW_КонтрагентыИспользующиеМодульБухгалтерияЭкпедитора/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	
	ВНД_Контрагенты = ПолучитьТаблицуКонтрагентов();
	
	ВнешнийНаборДанных = Новый Структура("ВНД_Контрагенты", ВНД_Контрагенты);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры   

Функция ПолучитьТаблицуКонтрагентов()
	
	Запрос = Новый Запрос;   
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;  
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА CW_ДоговорыПоГрузоперевозкам.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.CW_ВидыКонтрагентов.Покупатель)
	|		КОГДА CW_ДоговорыПоГрузоперевозкам.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.CW_ВидыКонтрагентов.Поставщик)
	|	КОНЕЦ КАК ВидКонтрагента,
	|	CW_ДоговорыПоГрузоперевозкам.Владелец КАК Контрагент,
	|	CW_ДоговорыПоГрузоперевозкам.Владелец.ИНН КАК ИНН
	|ПОМЕСТИТЬ ВТ_ИсходнаяТаблица
	|ИЗ
	|	Справочник.CW_ДоговорыПоГрузоперевозкам КАК CW_ДоговорыПоГрузоперевозкам
	|ГДЕ
	|	CW_ДоговорыПоГрузоперевозкам.Владелец.ИНН <> """"
	|	И CW_ДоговорыПоГрузоперевозкам.ПометкаУдаления = ЛОЖЬ
	|	И CW_ДоговорыПоГрузоперевозкам.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.Прочее)
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_ДоговорыПоГрузоперевозкам.Владелец,
	|	CW_ДоговорыПоГрузоперевозкам.Владелец.ИНН,
	|	ВЫБОР
	|		КОГДА CW_ДоговорыПоГрузоперевозкам.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.CW_ВидыКонтрагентов.Покупатель)
	|		КОГДА CW_ДоговорыПоГрузоперевозкам.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.CW_ВидыКонтрагентов.Поставщик)
	|	КОНЕЦ";  
	
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ИсходнаяТаблица.ВидКонтрагента КАК ВидКонтрагента,
	|	ВТ_ИсходнаяТаблица.ИНН КАК ИНН
	|ИЗ
	|	ВТ_ИсходнаяТаблица КАК ВТ_ИсходнаяТаблица
	|ИТОГИ ПО
	|	ВидКонтрагента";
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ВидыКонтрагентов = Перечисления.CW_ВидыКонтрагентов;
	
	СоответствиеВидаКонтрагентов = Новый Соответствие;
	СоответствиеВидаКонтрагентов.Вставить(ВидыКонтрагентов.Покупатель, "buyers");
	СоответствиеВидаКонтрагентов.Вставить(ВидыКонтрагентов.Поставщик,  "suppliers");
	
	СтруктураJSON = Новый Структура;
	
	ВыборкаВидКонтрагента = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВидКонтрагента.Следующий() Цикл
		
		МассивИНН 	= Новый Массив;
		Ключ		= СоответствиеВидаКонтрагентов.Получить(ВыборкаВидКонтрагента.ВидКонтрагента);  
		
		ВыборкаИНН = ВыборкаВидКонтрагента.Выбрать();
		Пока ВыборкаИНН.Следующий() Цикл
			МассивИНН.Добавить(XMLСтрока(ВыборкаИНН.ИНН));	
		КонецЦикла;   
		
		СтруктураJSON.Вставить(Ключ, МассивИНН);
	КонецЦикла;
	
	ТаблицаСтатусовКонтрагентов = ПолучитьИННКонтрагентовИспользующихМодуль(СтруктураJSON);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВнешняяТаблица.ИНН КАК ИНН,
	|	ВнешняяТаблица.ВидКонтрагента КАК ВидКонтрагента,
	|	ВнешняяТаблица.Статус КАК Статус
	|ПОМЕСТИТЬ ВТ_ВнешняяТаблица
	|ИЗ
	|	&ВнешняяТаблица КАК ВнешняяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсходнаяТаблица.ВидКонтрагента КАК ВидКонтрагента,
	|	ВТ_ИсходнаяТаблица.Контрагент КАК Контрагент,
	|	ВТ_ИсходнаяТаблица.ИНН КАК ИНН,
	|	ЕСТЬNULL(ВТ_ВнешняяТаблица.Статус, НЕОПРЕДЕЛЕНО) КАК Статус
	|ИЗ
	|	ВТ_ИсходнаяТаблица КАК ВТ_ИсходнаяТаблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВнешняяТаблица КАК ВТ_ВнешняяТаблица
	|		ПО ВТ_ИсходнаяТаблица.ИНН = ВТ_ВнешняяТаблица.ИНН
	|			И ВТ_ИсходнаяТаблица.ВидКонтрагента = ВТ_ВнешняяТаблица.ВидКонтрагента";
	
	Запрос.УстановитьПараметр("ВнешняяТаблица", ТаблицаСтатусовКонтрагентов); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ПолучитьИННКонтрагентовИспользующихМодуль(Знач ПараметрыПроцедуры)
	
	//Статусы для контрагентов, в группировке "Поставщик":
	//	1 - "Предоставляет документы" (зеленый цвет шрифта). Статус выводится при наличии у контрагента действующей подписки на сервис "Личный кабинет клиента" и наличие ИНН контрагента в регистре организаций предоставляющих доступ к документам.
	//	2 - "Готов предоставлять документы" (оранжевый цвет шрифта). Статус выводится при наличии у контрагента действующей подписки на сервис "Личный кабинет клиента" и отсутствии ИНН контрагента в регистре организаций предоставляющих доступ к документам.
	//	3 - "Может предоставлять документы" (черный цвет шрифта). Статус выводится если не выполняются условия в п.1 и п.2.
 	//Статусы для контрагентов, в группировке "Клиент":
	//	1 - "Готов принимать документы" (зеленый цвет шрифта). Статус выводится при наличии у контрагента действующей подписки на получение обновлений модуля.
	//	2 - "Может принимать документы" (оранжевый цвет шрифта). Статус выводится при отсутствии у контрагента действующей подписки на получение обновлений модуля.

	
	УстановитьПривилегированныйРежим(Истина);
	
	РегистрационныйНомер = CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();   
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",		XMLСтрока(РегистрационныйНомер));  
	СтруктураJSON.Вставить("contractors ",	ПараметрыПроцедуры); 
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("af_checkcontractors", СтруктураJSON);
	
	HTTPОтвет = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET");  
	
	Если HTTPОтвет = Неопределено или HTTPОтвет.КодСостояния <> 200 Тогда 
		ЗаписьЖурналаРегистрации("af_checkcontractors", 
			УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Отчеты.CW_КонтрагентыИспользующиеМодульБухгалтерияЭкпедитора,
			,
			HTTPОтвет.ПолучитьТелоКакСтроку()); 
		
		ВызватьИсключение "не удалось получить данные!";
	КонецЕсли;  
	
	СтрокаJSON 		= HTTPОтвет.ПолучитьТелоКакСтроку();
	СтруктураJSON	= CW_РаботаСВнешнимиРесурсамиСервер.СтрокаJSONВОбъект(СтрокаJSON, Истина);  
	
	
	ДоступныеТипыСтаутса = Новый Массив;
	ДоступныеТипыСтаутса.Добавить(Тип("ПеречислениеСсылка.CW_СтатусыЭОДПокупателей"));
	ДоступныеТипыСтаутса.Добавить(Тип("ПеречислениеСсылка.CW_СтатусыЭОДПоставщиков"));   
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("ИНН", 			Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(50)));    
	ТаблицаЗначений.Колонки.Добавить("ВидКонтрагента", 	Новый ОписаниеТипов("ПеречислениеСсылка.CW_ВидыКонтрагентов"));    
	ТаблицаЗначений.Колонки.Добавить("Статус", 			Новый ОписаниеТипов(ДоступныеТипыСтаутса));    
	
	//Заполняем покупателей
	СоответствиеСтатусовПокупателей = Новый Соответствие;
	СоответствиеСтатусовПокупателей.Вставить("1", ПредопределенноеЗначение("Перечисление.CW_СтатусыЭОДПокупателей.ГотовПриниматьДокументы"));
	СоответствиеСтатусовПокупателей.Вставить("2", ПредопределенноеЗначение("Перечисление.CW_СтатусыЭОДПокупателей.МожетПриниматьДокументы"));
	
	СтатусыПокупателей = СтруктураJSON["buyers"];
	Для Каждого КлючЗначение из СтатусыПокупателей Цикл
		НоваяСтрока = ТаблицаЗначений.Добавить();
		НоваяСтрока.ИНН 			= КлючЗначение.Ключ; 
		НоваяСтрока.ВидКонтрагента 	= ПредопределенноеЗначение("Перечисление.CW_ВидыКонтрагентов.Покупатель"); 
		НоваяСтрока.Статус  		= СоответствиеСтатусовПокупателей.Получить(КлючЗначение.Значение); 
	КонецЦикла; 
	//---Заполняем покупателей
	
	//Заполняем поставщиков
	СоответствиеСтатусовПоставщиков = Новый Соответствие;
	СоответствиеСтатусовПоставщиков.Вставить("1", ПредопределенноеЗначение("Перечисление.CW_СтатусыЭОДПоставщиков.ПредоставляетДокументы"));
	СоответствиеСтатусовПоставщиков.Вставить("2", ПредопределенноеЗначение("Перечисление.CW_СтатусыЭОДПоставщиков.ГотовПредоставлятьДокументы"));
	СоответствиеСтатусовПоставщиков.Вставить("3", ПредопределенноеЗначение("Перечисление.CW_СтатусыЭОДПоставщиков.МожетПредоставлятьДокументы"));
	
	СтатусыПоставщиков = СтруктураJSON["suppliers"];
	Для Каждого КлючЗначение из СтатусыПоставщиков Цикл
		НоваяСтрока = ТаблицаЗначений.Добавить();
		НоваяСтрока.ИНН 			= КлючЗначение.Ключ; 
		НоваяСтрока.ВидКонтрагента 	= ПредопределенноеЗначение("Перечисление.CW_ВидыКонтрагентов.Поставщик"); 
		НоваяСтрока.Статус  		= СоответствиеСтатусовПоставщиков.Получить(КлючЗначение.Значение); 
	КонецЦикла;
	//---Заполняем поставщиков
	
	Возврат ТаблицаЗначений;
	
КонецФункции
